Autodesk.Revit.DB.Lighting.SphericalLightDistribution.#ctor(Autodesk.Revit.DB.Lighting.SphericalLightDistribution)
Creates a copy of the given spherical light distribution
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Lighting.SphericalLightDistribution.#ctor
Creates a spherical light distribution object.
Since:
2013

Autodesk.Revit.DB.Lighting.SphericalLightDistribution
This class encapsulates a spherical light distribution.
Since:
2013